Repository: pikougi-nabot/epochrefs-old
Catalog: commit/84000/data-translation-memory/toh44-45_84000-the-stem-array.tmx/chapters-5-9.tmx
Source language: bo
Languages: en

source: འཇིག་རྟེན་གྱི་ཁམས་དེ་དག་ན་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཇི་སྙེད་ཅིག་བཞུགས་ཤིང་འཚོ་སྐྱོང་ལ་འཇིག་རྟེན་གྱི་ཁམས་རྒྱ་མཚོ་དེ་དང་དེ་དག་དང་། འཇིག་རྟེན་གྱི་ཁམས་འབྱམ་ཀླས་པ་དེ་དང་དེ་དག་དང་། འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་ཕྱོགས་དེ་དང་དེ་དག་དང་། འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་རྒྱུད་དེ་དང་དེ་དག་དང་། འཇིག་རྟེན་གྱི་ཁམས་ཡོངས་སུ་འདུ་བ་དེ་དང་དེ་དག་དང་། འཇིག་རྟེན་གྱི་ཁམས་འབྱུང་བ་དེ་དང་དེ་དག་དང་། འཇིག་རྟེན་གྱི་ཁམས་སུ་བྱ་བ་དེ་དང་དེ་དག་དང་། འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་སྒོ་དེ་དང་དེ་དག་དང་། འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་བསྐལ་པར་བྱ་བ་དེ་དང་དེ་དག་དང་། འཇིག་རྟེན་གྱི་ཁམས་སུ་འཇུག་པ་དེ་དང་དེ་དག་དང་། འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་སྙིང་པོ་བྱང་ཆུབ་རྣམ་པར་བཀོད་པ་དེ་དང་དེ་དག་དང་། འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་འཁོར་གྱི་དཀྱིལ་འཁོར་དེ་དང་དེ་དག་ན།
en: “All the buddha bhagavats that are present, living, and remaining in those world realms, in that ocean of world realms, in that vast extent of world realms, in the world realms in the directions, in the world realms that are coming to an end, in the world realms that are assembled, in the world realms that are created, in those world realms that are named, in the gateways of those world realms, in the kalpas of those world realms, in the entrances into those world realms, and at the bodhimaṇḍas of those world realms, those buddha bhagavats who are teaching the Dharma in the circle of their assembled followers in those world realms—each of the tathāgatas among those tathāgatas has a variety of bodies that are as numerous as the atoms in the infinite buddha realms.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཇི་སྙེད་ཅིག་ཆོས་སྟོན་པའི་དེ་བཞིན་གཤེགས་པ་དེ་དག་ལས་དེ་བཞིན་གཤེགས་པ་རེ་རེ་ཞིང་ཡང་སངས་རྒྱས་ཀྱི་ཞིང་མཐའ་ཡས་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་ལུས་སྣ་ཚོགས་དང་། ལུས་རེ་རེ་ཞིང་ཡང་སངས་རྒྱས་ཀྱི་ཞིང་མཐའ་ཡས་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་མཆོད་པའི་སྤྲིན་གྱི་ཆར་འབེབས་ཤིང་སྤྱན་སྔར་འགྲོའོ།
en: I approach each of those bodies while sending down a rain from clouds of offering as numerous as the atoms in the infinite buddha realms.

source: །དེ་དག་ཏུ་ཕྱིན་ནས་ཀྱང་མེ་ཏོག་ཐམས་ཅད་དང་སྤོས་ཐམས་ཅད་དང་། ཕྲེང་བ་ཐམས་ཅད་དང་ཕྱེ་མ་ཐམས་ཅད་དང་། བྱུག་པ་ཐམས་ཅད་དང་ན་བཟའ་ཐམས་ཅད་དང་། རྒྱལ་མཚན་ཐམས་ཅད་དང་ལྷའི་བ་དན་ཐམས་ཅད་དང་བླ་རེ་ཐམས་ཅད་དང་། དྲ་བ་ཐམས་ཅད་དང་གཟུགས་ཐམས་ཅད་ཀྱི་མཆོད་པ་རྒྱུན་མ་ཆད་པར་བྱེད་དོ།
en: Having approached them, I make a continuous offering of all flowers, all incense, all garlands, all powders, all ointments, all food, all banners, all flags, all canopies, all networks of beads, and all ornaments.

source: །སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གིས་གང་ཇི་སྙེད་དུ་གསུངས་པ་དང་། བསྟན་པ་དང་། བརྗོད་པ་དང་། ཡང་དག་པར་བཤད་པ་དང་། ཡང་དག་པར་སྨོས་པ་དང་། ཡོངས་སུ་བརྗོད་པ་དང་། མན་ངག་དུ་གསུངས་པ་དང་། ཤིན་ཏུ་བསྟན་པ་དང་རབ་ཏུ་བརྗོད་པ་དེ་དག་ཐམས་ཅད་ཀྱང་ཤེས་ཤིང་འཛིན་ཏོ།
en: “I know and remember whatever all those buddha bhagavats say, teach, utter, explain, describe, elucidate, instruct, proclaim, and disclose.

source: །སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གི་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པ་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་ཀྱང་རྗེས་སུ་དྲན་ནོ།
en: “I remember all the pure buddha realms of those buddha bhagavats.

source: །ཤར་ཕྱོགས་སུ་ཇི་ལྟ་བ་དེ་བཞིན་དུ་ལྷོ་ཕྱོགས་དང་། ནུབ་ཕྱོགས་དང་བྱང་ཕྱོགས་དང་། བྱང་ཤར་གྱི་ཕྱོགས་མཚམས་དང་། ཤར་ལྷོའི་ཕྱོགས་མཚམས་དང་། ལྷོ་ནུབ་ཀྱི་ཕྱོགས་མཚམས་དང་། ནུབ་བྱང་གི་ཕྱོགས་མཚམས་དང་། འོག་དང་སྟེང་གི་ཕྱོགས་སུ་ཡང་འཇིག་རྟེན་གྱི་ཁམས་གཅིག་ཀྱང་འདའོ། །འཇིག་རྟེན་གྱི་ཁམས་གཉིས་དང་བཅུ་ཡང་འདའོ། །འཇིག་རྟེན་གྱི་ཁམས་བརྒྱ་ནས་འཇིག་རྟེན་གྱི་ཁམས་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱང་འདའོ།
en: As it is in the east, so it is in the south, the west, the north, the northeast, the southeast, the southwest, the northwest, above and below, beyond one world realm, beyond two world realms and ten world realms, beyond a hundred world realms, and so on, up to beyond as many world realms as there are atoms in even more innumerable than innumerable buddha realms.

source: །འཇིག་རྟེན་གྱི་ཁམས་དེ་དག་ན་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཇི་སྙེད་ཅིག་བཞུགས་ཤིང་འཚོ་སྐྱོང་ལ། འཇིག་རྟེན་གྱི་ཁམས་རྒྱ་མཚོ་དེ་དང་དེ་དག་དང་། འཇིག་རྟེན་གྱི་ཁམས་རྣམ་པར་དག་པ་དེ་དང་དེ་དག་ནས། འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་འཁོར་གྱི་དཀྱིལ་འཁོར་དེ་དང་དེ་དག་ན་ཆོས་སྟོན་པ་དེ་དག་ཀུན་ཀྱང་མཐོང་ངོ་།
en: “I see all the buddha bhagavats that are present, living, and remaining in those world realms, in that ocean of world realms, in those pure world realms, who are teaching the Dharma in the circle of their followers.

source: །དེ་བཞིན་གཤེགས་པ་དེ་དག་ལའང་མེ་ཏོག་ཐམས་ཅད་ནས་གཟུགས་ཐམས་ཅད་ཀྱི་བར་གྱི་མཆོད་པ་བྱེད་དོ། །སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གིས་གང་ཇི་སྙེད་དུ་གསུངས་པ་ནས། རབ་ཏུ་བརྗོད་པའི་བར་དེ་དག་ཐམས་ཅད་ཀྱང་ཡོངས་སུ་ཤེས་ཤིང་འཛིན་ཏོ།
en: I make offerings to those tathāgatas with all flowers, and so on, up to all ornaments. I know and remember whatever all those buddha bhagavats say, and so on, and what they disclose.

source: །སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གི་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པ་གང་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་ཀྱང་རྗེས་སུ་དྲན་ནོ།
en: I remember all the pure buddha realms that there are of those buddha bhagavats.

source: །སེམས་ཅན་གང་གིས་ཁོ་བོ་མཐོང་བར་གྱུར་བ་དང་། གང་དང་འགྲོགས་པར་གྱུར་པ་དེ་དག་ཀུན་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ངེས་པར་འགྱུར་རོ།
en: “Whatever being sees me, who associates with me, will definitely attain the highest, complete enlightenment.

source: །སེམས་ཅན་ཕྲ་མོ་འམ་རགས་པ་འམ་ངན་པའམ་བཟང་བའམ་བདེ་བའམ་མི་བདེ་བ་གང་ཇི་སྙེད་ཅིག་ཁོ་བོས་མཐོང་བར་གྱུར་པ་དེ་དག་ཀུན་ལ་ཡང་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། འདུལ་བའི་དུས་ལས་མི་འདའ་བར་བྱ་བའི་ཕྱིར། ཁོང་ཏ་དེ་དག་གི་ལུས་ཀྱི་ཚད་དང་མཉམ་པར་ལུས་བྱིན་གྱིས་རློབ་བོ།
en: Whether they are small or huge, good or bad, happy or unhappy beings, however many of them see me, I will bless all of their bodies and I will not let the time to ripen and guide them pass.

source: །སེམས་ཅན་ཇི་སྙེད་ཅིག་ཁོ་བོའི་དྲུང་དུ་འོང་བ་དེ་དག་ཐམས་ཅད་ཀྱང་།
en: However many beings come before me, I will establish all of them in this bodhisattva liberation that goes everywhere and has fruitful prowess.

source: བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་ཀུན་ཏུ་འགྲོ་བ་འདི་དང་། བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་རྣམ་པར་གནོན་པ་དོན་ཡོད་པ་ལ་རབ་ཏུ་གཞོག་གོ །རིགས་ཀྱི་བུ་ཁོ་བོས་ནི་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་ཐོགས་པ་མེད་པའི་སྒོ་ཀུན་ཏུ་འགྲོ་བ་དེ་བཞིན་གཤེགས་པའི་མཆོད་པ་དང་། རིམ་གྲོ་རབ་ཏུ་སྦྱོར་བ་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། མཐུན་པ་འདི་ཤེས་པར་ཟད་ན། ཁོ་བོས་བྱང་ཆུབ་སེམས་དཔའ་སྙིང་རྗེ་ཆེན་པོའི་ངང་ཚུལ་ཅན། ཐེག་པ་ཆེན་པོའི་ངང་ཚུལ་ཅན། བྱང་ཆུབ་སེམས་དཔའི་ལམ་དང་མི་འབྲལ་བའི་ངང་ཚུལ་ཅན། ཐོགས་པ་མེད་པའི་ངང་ཚུལ་ཅན། བྱང་ཆུབ་སེམས་དཔའི་བསམ་པའི་སྙིང་པོ་ཆུད་མི་གསོན་པའི་ངང་ཚུལ་ཅན། བྱང་ཆུབ་ཀྱི་སེམས་ཡོངས་སུ་མི་གཏོང་བའི་ངང་ཚུལ་ཅན། སངས་རྒྱས་ཀྱི་ཆོས་ལ་ལྷག་པར་དམིགས་པའི་ངང་ཚུལ་ཅན། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཡིད་ལ་བྱ་བ་དང་མི་འབྲལ་བའི་ངང་ཚུལ་ཅན། ནམ་མཁའ་དང་མཉམ་པའི་ངང་ཚུལ་ཅན། འཇིག་རྟེན་ཐམས་ཅད་ལ་མི་གནས་པའི་ངང་ཚུལ་ཅན། ཆུད་མི་གསོན་པའི་ངང་ཚུལ་ཅན། མཉམས་པའི་ངང་ཚུལ་ཅན། མ་གོད་པའི་ངང་ཚུལ་ཅན། གླགས་མེད་པའི་ངང་ཚུལ་ཅན། མ་འདྲེས་པའི་ངང་ཚུལ་ཅན།
en: “Noble one, I know only this bodhisattva liberation that goes everywhere, which is dedicated to making offerings and serving the tathāgatas and which is an unimpeded gateway favorable for ripening all beings.

source: རྙོག་པ་མེད་པའི་ངང་ཚུལ་ཅན། འགྱོད་པ་མེད་པའི་ངང་ཚུལ་ཅན། རྣམ་པར་དག་པའི་ངང་ཚུལ་ཅན། བྱང་ཆུབ་སེམས་དཔའ་རྡུལ་དང་བྲལ་བ་དེ་དག་གི་སྤྱོད་པ་ཤེས་པའམ། ཡོན་ཏན་བརྗོད་པ་ནུས་རེ་སྐན།
en: “How could I know or describe the qualities of the bodhisattvas who have the conduct of great compassion, who have the conduct of practicing the Mahāyāna, who have the conduct that is never apart from the path of the bodhisattvas, who have unimpeded conduct, who have the conduct of the essence of bodhisattva motivation that is never lost, who have the conduct that never forsakes the aspiration to enlightenment, who have the conduct that is focused on the Buddhadharma, who have the conduct that is never apart from attention to omniscience, who have the conduct that is as vast as space, who have the conduct that is not based on the world, who have the conduct that is never lost, who have the conduct that never deteriorates, who have the conduct that is never impaired, who have the conduct that is never destroyed, who have the conduct that is never adulterated, who have the conduct that is never polluted, who have the conduct that is without regret, who have pure conduct, and who have bodhisattva conduct that is stainless? “Depart, noble one.

source: །སོང་རིགས་ཀྱི་བུ་ལྷོ་ཕྱོགས་ཀྱི་རྒྱུད་འདི་ཉིད་ན། དྲ་བྱི་ལའི་གྲོང་རྡལ་རྡོ་རྗེའི་གྲོང་ཁྱེར་ཅན་བྱ་བ་ཡོད་དེ།
en: In this southern region, in the land of Draviḍa, there is a town called Vajrapura.

source: དེ་ན་དྲ་བྱི་ལའི་སྤྲིན་ཅེས་བྱ་བ་འདུག་གིས་དེའི་གན་དུ་སོང་ལ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བྱ་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བྱ་བ་དྲིས་ཤིག །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་དགེ་སློང་རབ་ཏུ་བརྟན་པའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ནས།
en: There dwells a Dravidian by the name of Megha . Go to him and ask him, ‘How does a bodhisattva train in bodhisattva conduct? How does a bodhisattva practice it?’

source: ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ཏེ། ཡང་དང་ཡང་བལྟས་ནས་དགེ་སློང་ཤིན་ཏུ་བརྟན་པའི་དྲུང་ནས་སོང་ངོ་།
en: Then Sudhana, the head merchant’s son, bowed his head to the feet of the bhikṣu Supratiṣṭhita, circumambulated the bhikṣu Supratiṣṭhita to his right a hundred thousand times, and, looking back a hundred thousand times, departed from the bhikṣu Supratiṣṭhita.

source: །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཆོས་ཀྱི་དད་པའི་ཤུགས་དང་། བྱིན་གྱིས་ནོན་པ།
en: Sudhana, the head merchant’s son, was filled with the power and might of faith in the Dharma.

source: སངས་རྒྱས་ཡིད་ལ་བྱ་བའི་འདུ་ཤེས་དང་ལྡན་པ།
en: He was focused on the idea of following the Buddha;

source: དཀོན་མཆོག་གསུམ་གྱི་གདུང་མི་གཅད་པ་ལ་རབ་ཏུ་བརྩོན་པ།
en: he was sincerely dedicated to the lineage of the Three Jewels;

source: དུས་གསུམ་སྣང་བས་སེམས་སྣང་བར་གྱུར་པ་སྨོན་ལམ་ཆེན་པོ་ཡིད་ལ་བྱེད་པ་དང་ལྡན་པ་སེམས་ཅན་གྱི་ཁམས་ཐམས་ཅད་ཡོངས་སུ་བསྐྱབ་པའི་ཐབས་ལ་ཞུགས་པ།
en: his mind illuminated the worlds of the three times; he was focused on following the great aspiration; he was continuously dedicated to saving all the realms of beings;

source: འདུས་བྱས་ཀྱི་དགེ་བ་ཐམས་ཅད་ལ་མི་གནས་པའི་སེམས་དང་ལྡན་པ། ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་ངེས་པར་རྟོགས་པར་བྱ་བ་ལ་བརྩོན་པ།
en: his mind did not dwell on composite pleasures; he was devoted to contemplating the nature of all phenomena;

source: འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཡོངས་སུ་སྦྱང་བའི་སྨོན་ལམ་ལས་མི་གཡོ་བ།
en: he never deviated from the aspiration to purify all world realms;

source: སངས་རྒྱས་ཐམས་ཅད་ཀྱི་འཁོར་གྱི་དཀྱིལ་འཁོར་ན་གནས་པ་མེད་པར་གནས་པ་ཆོས་ཀྱི་སྣང་བ་དེ་རྗེས་སུ་དྲན་པར་བྱ་བ་དང་། དགེ་བའི་བཤེས་གཉེན་རྗེས་སུ་དྲན་པར་བྱ་བ་དང་། འདོད་ཆགས་དང་བྲལ་བའི་རིགས་ཡོངས་སུ་བརྗོད་པ་བྱེད་ཅིང་།
en: he dwelled without attachment in the circles of the assemblies of all the buddhas; he remembered the light of the Dharma; he remembered his kalyāṇamitras; and he proclaimed the lineage of freedom from desire.

source: མཐར་གྱིས་དྲ་བྱི་ལའི་གྲོང་རྡལ་རྡོ་རྗེའི་གྲོང་ཁྱེར་དུ་ཕྱིན་ནས། དྲ་བྱི་ལའི་སྤྲིན་ཡོངས་སུ་ཚོལ་ཚོལ་བ་ལས།
en: Eventually he arrived at Vajrapura in the Draviḍa region.

source: གྲོང་ཁྱེར་གྱི་ཁྱམས་ཤིག་ན་ཆོས་བསྟན་པའི་དོན་དུ་སེང་གེའི་ཁྲིལ་འདུག་ཅིང་།
en: He searched and searched for the Dravidian Megha until he saw him in one of the courtyards in the town.

source: སྲོག་ཆགས་སྟོང་ཕྲག་བཅུ་ཙམ་ཞིག་ལ་ཆོས་ཀྱི་རྣམ་གྲངས་ཡི་གེའི་འཁོར་ལོའི་རྒྱུད་ཀྱི་རྒྱན་ཅེས་བྱ་བ་ཡོངས་སུ་སྟོན་ཅིང་འདུག་པ་མཐོང་ངོ་། །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་དྲ་བྱི་ལའི་སྤྲིན་གྱི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ།
en: He was seated on a lion throne in order to teach the Dharma, and he was teaching the Dharma teaching called the display of the rotating wheel of syllables to about ten thousand beings.

source: དྲ་བྱི་ལའི་སྤྲིན་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས་མདུན་དུ་འདུག་སྟེ། ཐལ་མོ་སྦྱར་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ། །འཕགས་པ་བདག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ན།
en: Sudhana, the head merchant’s son, bowed his head to the feet of the Dravidian Megha , circumambulated the Dravidian Megha to his right many hundreds of thousands of times, sat before him, and with palms together said, “Ārya, I have developed the aspiration for the highest, complete enlightenment.

source: ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བགྱི་བ་དང་། ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་ཀྱི་སེམས་སྲིད་པའི་ལམ་རྒྱུད་ཐམས་ཅད་དུ་ཆབ་མི་འཚལ་བ་དང་། ཇི་ལྟར་ཡོངས་སུ་སྐྱོ་བ་མ་མཆིས་ཤིང་།
en: However, I do not know how bodhisattvas should train in bodhisattva conduct; how they should practice it; how bodhisattvas do not lose the aspiration to enlightenment; how they keep their motivation firm within all the states of existence so that they do not lose heart; how they purify their resolve so that they do not become oppressed;

source: བསམ་པ་བརྟན་པར་འགྱུར་བ་དང་། ཇི་ལྟར་ཐུབ་པ་མ་མཆིས་ཤིང་ལྷག་པའི་བསམ་པ་ཡོངས་སུ་དག་པར་འགྱུར་བ་དང་། ཇི་ལྟར་ཡོངས་སུ་སྐྱོབ་མ་མཆིས་ཤིང་སྙིང་རྗེ་ཆེན་པོའི་སྟོབས་ཡང་དག་པར་སྐྱེ་བར་འགྱུར་བ་དང་ཇི་ལྟར་སྒོ་ཀུན་ནས་རྣམ་པར་དག་ཅིང་གཟུངས་ཀྱི་སྟོབས་གནོན་པར་འགྱུར་བ་དང་། ཇི་ལྟར་མ་རིག་པའི་རབ་རིབ་དང་སྒྲིབ་པ་རྣམ་པར་འཐོར་ཞིང་།
en: how they develop the power of great compassion so that they do not lose heart; how they gain the power of retention so that all gateways are purified; how they develop the light of wisdom, the light that frees all phenomena from darkness, so that the darkness that obscures omniscience will be dispersed;

source: ཤེས་རབ་ཀྱི་འོད་ཆོས་ཐམས་ཅད་ལ་རབ་རིབ་མ་མཆིས་པའི་སྣང་བ་སྐྱེ་བར་འགྱུར་བ་དང་། ཇི་ལྟར་དོན་དང་ཆོས་དང་ངེས་པའི་ཚིག་དང་སྤོབས་པ་ལ་མཁས་པའི་དབྱངས་ཀྱི་དཀྱིལ་འཁོར་ཡོངས་སུ་རྫོགས་ཤིང་།
en: how they gain the power of discernment so that they perfect the domain of voice through being skilled in meaning, Dharma, definitions, and eloquence;

source: སོ་སོ་ཡང་དག་པར་རིག་པའི་སྟོབས་གནོན་པར་འགྱུར་བ་དང་། ཇི་ལྟར་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་འཁོར་ལོ་ཐ་མི་དད་པ་ཡང་དག་པར་འཛིན་ཅིང་དྲན་པའི་སྟོབས་ཡོངས་སུ་གནོན་པར་འགྱུར་བ་དང་། ཇི་ལྟར་ཆོས་ཐམས་ཅད་ཀྱི་ཕྱོགས་རིགས་པའི་སྣང་བ་རྗེས་སུ་རྟོག་ཅིང་།
en: how they gain the power of memory so that they will possess without differentiation all the Buddha’s Dharma wheels; how they purify states of rebirth so that they will realize and follow the light in all rebirths and phenomena in all directions;

source: རིག་པའི་སྟོབས་རྣམ་པར་དག་པར་འགྱུར་བ་དང་། ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་གྱི་སྟོབས་ཆོས་ཐམས་ཅད་ཀྱི་དོན་རྣམ་པར་གདོན་མི་ཟ་བར་རབ་ཏུ་དབྱེ་བ་ལ་བརྩོན་པས་འགྲུབ་པར་འགྱུར་བ་མ་འཚལ་ཏོ།
en: and how the power of bodhisattvas’ samādhi is brought forth so as to have the highest certainty and analysis of all the meanings of the Dharma.”

source: །དེ་ནས་དྲ་བྱི་ལའི་སྤྲིན་གྱིས་བྱང་ཆུབ་སེམས་དཔའ་ལ་རིམ་གྲོ་བྱ་བའི་ཕྱིར་སེང་གེའི་ཁྲི་དེ་ལས་ལངས་ཏེ་བབས་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་ལུས་ཐམས་ཅད་ཀྱིས་ཕྱག་བྱས་ནས།
en: Then the Dravidian Megha , in order to show respect to the bodhisattva, rose from his throne, stepped down, and with his entire body prostrated before Sudhana, the head merchant’s son.

source: ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་གསེར་གྱི་མེ་ཏོག་གི་ཕུང་པོས་མངོན་པར་གཏོར་ཏོ།
en: He scattered a heap of golden flowers toward Sudhana, the head merchant’s son.

source: །ནོར་བུ་རིན་པོ་ཆེ་རིན་ཐང་མེད་པ་མང་པོ་དང་། ཙན་དན་གྱི་ཕྱེ་མ་དམ་པས་ཀྱང་མངོན་པར་གཏོར་ཏོ།
en: He scattered many priceless precious jewels and supreme sandalwood powder.

source: །གོས་ཚོན་སྣ་ཚོགས་རྣམ་པ་ཐ་དད་པས་ཁ་དོག་བསྒྱུར་བ་བརྒྱ་སྟོང་ཕྲག་དུ་མས་ཀྱང་མངོན་པར་བཀབ་བོ།
en: He draped him in many hundreds of thousands of cloths that had been dyed in various colors.

source: །སྤོས་ཀྱི་མེ་ཏོག་ཁ་དོག་རྣམ་པ་ཐ་དད་ཅིང་ཡིད་དུ་འོང་ལ་བལྟ་ན་སྡུག་པ་མང་པོས་ཀྱང་མངོན་པར་གཏོར་ནས་མཆོད་པའི་རྣམ་པ་སྣ་ཚོགས་གཞན་དག་གིས་ཀྱང་།
en: He scattered many beautiful and delightful perfumed flowers of many different colors.

source: མཆོད་པ་དང་རིམ་གྲོ་དང་། བཀུར་སྟི་དང་བསྟི་སྟང་ཆེར་བྱས་ཏེ།
en: He also made offerings with other kinds of offerings, showing him respect, honor, and veneration.

source: ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་དེ་ལྟར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་ལེགས་སོ་ལེགས་སོ། །རིགས་ཀྱི་བུ་གང་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་དེ་ནི། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་གདུང་མི་གཅད་པའི་ཕྱིར་ཞུགས་པ་ཡིན་ནོ། །འདོད་ཆགས་དང་བྲལ་བའི་རིགས་ཡང་དག་པ་ཅི་ལྟ་བ་བཞིན་དུ་རྣམ་པར་རིག་པར་བྱ་བ་ལ་བརྩོན་པ་ཡིན། ཞིང་གི་རྒྱུད་ཐམས་ཅད་ཡོངས་སུ་དག་པར་བྱ་བ་ལ་ཞུགས་པ་ཡིན། སེམས་ཅན་གྱི་རིགས་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། འདུལ་བ་ལ་སྟ་གོན་དུ་གནས་པ་ཡིན། ཆོས་ཀྱི་རིགས་ཐམས་ཅད་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་བརྟག་པ་ལ་བརྩོན་པ་ཡིན། ལས་ཀྱི་རིགས་ཐམས་ཅད་དང་མི་འགལ་བར་གནས་པ་ཡིན། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའི་རིགས་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བྱ་བ་ལ་རབ་ཏུ་བརྩོན་པ་ཡིན། སྨོན་ལམ་གྱི་རིགས་ཐམས་ཅད་རྒྱུན་མི་འཆད་པའི་ཕྱིར་ཡང་དག་པར་ཞུགས་པ་ཡིན། དུས་གསུམ་གྱི་རྒྱུད་ཐམས་ཅད་ཡེ་ཤེས་ཀྱི་ཁོང་དུ་ཆུད་པར་བྱ་བ་ལ་ཞུགས་པ་ཡིན། མོས་པའི་རིགས་ཤིན་ཏུ་བརྟན་པར་བྱ་བའི་ཕྱིར་བརྩོན་པ་ཡིན་ཏེ།
en: He said to Sudhana, the head merchant’s son, “Noble one, it is excellent, excellent, that you have developed the aspiration for the highest, complete enlightenment and that you have an unceasing dedication to the lineage of all the buddhas, you are dedicated to correctly imparting knowledge of the lineage of freedom from desire, you practice the purification of the classes of realms, you are prepared for ripening and guiding all classes of beings, you are dedicated to correctly examining all the traditions of the Dharma, you maintain a state of not contravening all the classes of karma, you are dedicated to perfecting the classes of bodhisattva conduct, you correctly engage in a continuity of all classes of prayers, you engage in comprehending through wisdom all the classes of three times, and you are dedicated to making firm the classes of motivations.

source: དེ་ནི་དེ་བཞིན་གཤེགས་པ་མང་པོ་ཐམས་ཅད་ཀྱི་བྱིན་གྱིས་བརླབས་པ་ཡིན། སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་ཡང་དག་པར་དགོངས་པ་ཡིན། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་དང་མཉམ་པ་ཉིད་དུ་གྱུར་པ་ཡིན། འཕགས་པ་ཐམས་ཅད་ཀྱི་རྗེས་སུ་དགྱེས་པར་བྱ་བ་ཡིན། ཚངས་པའི་དབང་པོ་ཐམས་ཅད་ཀྱིས་མངོན་པར་དགའ་བར་བྱས་པ་ཡིན། ལྷའི་དབང་པོ་ཐམས་ཅད་ཀྱིས་ཡང་དག་པར་མཆོད་པ་ཡིན། གནོད་སྦྱིན་གྱི་དབང་པོ་ཐམས་ཅད་ཀྱིས་ཡོངས་སུ་བསྲུང་བ་ཡིན། སྲིན་པོའི་དབང་པོ་ཐམས་ཅད་ཀྱིས་རིམ་གྲོར་བྱས་པ་ཡིན། ཀླུའི་དབང་པོ་ཐམས་ཅད་ཀྱིས་བསུ་བ་ཡིན། མིའམ་ཅིའི་དབང་པོ་ཐམས་ཅད་ཀྱིས་མངོན་པར་བསྟོད་པ་ཡིན། འཇིག་རྟེན་གྱི་དབང་པོ་ཐམས་ཅད་ཀྱིས་ཡང་དག་པར་བསྔགས་པ་ཡིན།
en: “That is the blessing of all the many tathāgatas, that is the intention of all the buddhas, that is the attainment of equality of all the bodhisattvas, that is what all the āryas rejoice in, that is what delights all the Brahmakāyika lords, that is what is offered to by all the deva lords, that is what is protected by all the yakṣa lords, that is what is honored by all the rākṣasa lords, that is what is welcomed by all the nāga lords, that is what is praised by all the kinnara lords, and that is what is praised by all the lords of the world.

source: དེས་ནི་སེམས་ཅན་གྱི་ཁམས་ཐམས་ཅད་ཀྱང་ངན་སོང་གི་ལམ་རྒྱུད་གསུམ་པོ་ཡོངས་སུ་གཅད་པ་དང་མི་ཁོམ་པ་དང་། ངན་འགྲོ་ལམ་ཐམས་ཅད་བཟློག་པ་དང་། དབུལ་བའི་ལམ་ཐམས་ཅད་ལས་ཡང་དག་པར་བཟླ་བ་དང་། ལྷ་དང་མིའི་ཕུན་སུམ་ཚོགས་པ་ཐོབ་པར་བྱ་བ་དང་། དགེ་བའི་བཤེས་གཉེན་མཐོང་བ་དང་མི་འབྲལ་བ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་རྒྱ་ཆེན་པོ་མཉམ་པ་དང་། འབྲལ་བར་མི་འགྱུར་བ་དང་། བྱང་ཆུབ་ཀྱི་སེམས་ཀྱི་ཡན་ལག་ཡོངས་སུ་དག་པར་བྱ་བ་དང་། བྱང་ཆུབ་ཀྱི་སེམས་འབྱུང་བའི་རྒྱུད་ཡོངས་སུ་བསྒྲུབ་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ལམ་སྣང་བ་ཐོབ་པར་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཡེ་ཤེས་ཁོང་བུ་ཆུད་པར་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ས་ལ་གནས་པར་བྱ་བས་དབུགས་ཕྱིན་པར་བྱས་པ་ཡིན།
en: “It is what prevents the entire realm of beings from being reborn in the three lower existences and turns them away from all paths to unfortunate and lower existences. It turns them away from the paths that lead to poverty. It brings the attainment of the good fortune of devas and humans. “Through it there will be no separation from seeing the kalyāṇamitra, no separation from the vast ocean of the Buddhadharma; it purifies the aspiration for enlightenment, it accomplishes the cause of the aspiration for enlightenment, it obtains the illumination of the bodhisattva path, it brings the realization of bodhisattva wisdom, and it brings the relief of being on the level of a bodhisattva.

source: རིགས་ཀྱི་བུ་དེ་ལ་བདག་འདི་སྙམ་དུ་སེམས་ཏེ།
en: “Noble one, this is what I think:

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་དཀའ་བ་བྱེད་པ་སྟེ། འབྱུང་བར་དཀའ་ཞིང་མཐོང་བར་དཀའ་བའོ།
en: the bodhisattvas accomplish what is difficult, they are the manifestation of a sight that is difficult to obtain, and they are a comfort to the world;

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་སེམས་ཅན་རྣམས་ལ་བག་དྲོ་བར་བྱེད་པས་ཕ་དང་མ་ལྟ་བུའོ།
en: the bodhisattvas are like fathers and mothers to all beings;

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་གྱི་རྒྱན་ཏུ་གྱུར་པའོ།
en: the bodhisattvas are like adornments for this world and its paradises;

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་སྡུག་བསྔལ་གྱིས་མནར་བ་རྣམས་ལ་སྐྱབས་སུ་གྱུར་པའོ།
en: the bodhisattvas save beings from the torments of suffering;

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་འགྲོ་བ་ཐམས་ཅད་ཡོངས་སུ་བསྲུང་བའི་ཕྱིར་གནས་སུ་གྱུར་པའོ།
en: the bodhisattvas remain in order to protect all beings;

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་འཇིགས་པ་སྣ་ཚོགས་ཀྱིས་གཙེས་པ་རྣམས་ལ་དཔུང་གཉེན་དུ་གྱུར་པའོ།
en: the bodhisattvas are a refuge from the misfortune of various kinds of danger;

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་འགྲོ་བ་ཐམས་ཅད་ངན་སོང་གསུམ་དུ་ལྟུང་བ་ལས་ཡོངས་སུ་རྟོན་པའི་ཕྱིར་རླུང་གི་དཀྱིལ་འཁོར་ལྟ་བུའོ།
en: the bodhisattvas are like the disk of air because it prevents beings from falling into the lower existences;

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དགེ་བའི་རྩ་བ་རྣམ་པར་འཕེལ་བར་བྱེད་པས་ས་ལྟ་བུའོ།
en: the bodhisattvas are like the earth because they increase the roots of merit of all beings;

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་བསོད་ནམས་རིན་པོ་ཆེའི་མཛོད་མི་ཟད་པའི་གཏོས་དང་ལྡན་པས་རྒྱ་མཚོ་ལྟ་བུའོ། །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་ཡེ་ཤེས་ཀྱི་འོད་ཀྱིས་སྣང་བར་བྱེད་པའི་ཕྱིར་ཉི་མ་ལྟ་བུའོ།
en: the bodhisattvas are like the ocean because they contain an inexhaustible treasure of precious merit; the bodhisattvas are like the sun because they shine with the light of wisdom;

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་དགེ་བའི་རྩ་བས་ཤིན་ཏུ་མཐོ་བས་རི་རབ་ལྟ་བུའོ།
en: the bodhisattvas are like Sumeru because of the great height of their roots of merit;

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་སྙིང་པོ་བྱང་ཆུབ་ཏུ་ཡེ་ཤེས་ཀྱི་ཟླ་བ་འཆར་བར་འགྱུར་བའི་ཕྱིར་ཟླ་བ་ལྟ་བུའོ།
en: the bodhisattvas are like the moon because they rise as the moon of the wisdom of the essence of enlightenment;

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་བདུད་ཀྱི་སྡེ་ཐམས་ཅད་རབ་ཏུ་འཇོམས་པས་དཔའ་བོར་གྱུར་པའོ།
en: the bodhisattvas are like warriors because they defeat the armies of the māras;

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་རང་བྱུང་གི་ཆོས་ཀྱི་གྲོང་ཁྱེར་དུ་ཕྱིན་པར་བྱེད་པས་རྟུལ་ཕོད་པ་ལྟ་བུའོ།
en: the bodhisattvas are like heroes because they reach the self-arisen city of the Dharma;

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་བག་ལ་བྱམས་པའི་རླན་ཡོངས་སུ་སྐེམ་པས་མེ་ལྟ་བུའོ།
en: the bodhisattvas are like Agni because they dry up the wetness of the self-love of all beings;

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་ཆོས་ཀྱི་སྤྲིན་རྒྱ་ཆེན་པོའི་ཆར་མངོན་པར་འབེབས་པས་སྤྲིན་ལྟ་བུའོ།
en: the bodhisattvas are like clouds because they send down rain from the vast cloud of the Dharma;

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་སེམས་ཅན་གྱི་དབང་པོ་དད་པ་ལ་སྩོགས་པའི་མྱུ་གུ་རྣམ་པར་འཕེལ་བར་བྱེད་པས་ཆར་པ་ལྟ་བུའོ།
en: the bodhisattvas are like rain because they increase the sprouts of the faculties, faith, and so on of beings;

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་ཆོས་རྒྱ་མཚོའི་འགྲམ་ཡོངས་སུ་སྟོན་པས་མཉན་པ་ལྟ་བུའོ།
en: the bodhisattvas are like mariners because they reveal the point of embarkation for crossing the ocean of the Dharma;

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་སེམས་ཅན་ཐམས་ཅད་འཁོར་བའི་རྒྱ་མཚོ་ལས་ཡང་དག་པར་སྒྲོལ་བའི་ཕྱིར་ཟམ་པ་ལྟ་བུའོ།
en: the bodhisattvas are like a bridge because they enable all beings to cross over the ocean of saṃsāra;

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱིས་མངོན་པར་བགྲོད་པར་བྱ་བའི་ཕྱིར་མུ་སྟེགས་ལྟ་བུའོ།
en: and the bodhisattvas are like fords because they enable beings to cross over.”

source: །དེ་ལྟར་དྲ་བྱི་ལའི་སྤྲིན་གྱིས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱི་མདུན་དུ་འདུག་སྟེ།
en: In that way, Megha the Dravidian, while sitting before Sudhana, the head merchant’s son, praised the bodhisattvas with those words and congratulated Sudhana, the head merchant’s son.
